## Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}

In [5]:
data =pd.DataFrame(data)

In [6]:
#1 head

data.head()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [18]:
data.tail()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [19]:
data['Age'].min()

18

In [20]:
data['Age'].max()

21

In [21]:
data.describe()

             Age
count   4.000000
mean   19.500000
std     1.290994
min    18.000000
25%    18.750000
50%    19.500000
75%    20.250000
max    21.000000

In [26]:
data.set_index('Name')

       Age
Name
Tom     20
nick    21
krish   19
jack    18

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [51]:
df = {'A': [2,3,4,5,6],
     'B': [6,7,8,9,3],
     'C': [3,4,5,12,7]}

In [52]:
df = pd.DataFrame(df)

In [53]:
df

   A  B   C
0  2  6   3
1  3  7   4
2  4  8   5
3  5  9  12
4  6  3   7

In [54]:
def reindex_df(df):
    new_df = df.reset_index(drop=True)
    new_df.index = new_df.index * 2 + 1
    return new_df

In [55]:
new_df = reindex_df(df)
df = print(new_df)

   A  B   C
1  2  6   3
3  3  7   4
5  4  8   5
7  5  9  12
9  6  3   7

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. Thefunction should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [56]:
df1 = {'values': [10,20,30,40,50]}

In [58]:
df1 =pd.DataFrame(df1)

In [75]:
def fun1(df):
    x = sum(df['values'][0:3])
    print(x)

In [76]:
fun1(df1)

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [78]:
df2 = {'Text':['my name is xvf','cbjkdjdv','sdhduhd']}
df2 = pd.DataFrame(df2)

In [96]:
df2['Word_Count'] = df2['Text'].apply(len)

In [97]:
df2

             Text  Word_Count
0  my name is xvf          14
1        cbjkdjdv           8
2         sdhduhd           7

## Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and columns. The returned value is an integer.


DataFrame.shape() returns a tuple that contains the number of rows and columns in the DataFrame, in that order. The returned value is a tuple of integers.

## Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel()

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [99]:
df3 = {'Email': ['abc@gmail.com','ddd@domain.com']}
df3 = pd.DataFrame(df3)

In [100]:
df3

            Email
0   abc@gmail.com
1  ddd@domain.com

In [111]:
df3["Username"] = df3['Email'].str.split('@').str[0]

In [112]:
df3.head()

            Email Username
0   abc@gmail.com      abc
1  ddd@domain.com      ddd

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [130]:
df4 = {'A': [3,8,6,2,9],
     'B': [5,2,9,3,1],
     'C': [1,7,4,5,2]}
df4 = pd.DataFrame(df4)

In [131]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [132]:
d = []

def fun2(df4):
    for i in df4['A']:
        if i >5:
            d.append(i)

In [133]:
fun2(df4)

In [134]:
print(d)

[8, 6, 9]

In [144]:
e = []

def fun3(df4):
    for j in df4['B']:
        if j>2:
            e.append(j)

In [145]:
fun3(df4)

In [146]:
print(e)

[5, 9, 3]

In [148]:
pd.DataFrame(d,e).T

   5  9  3
0  8  6  9

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [149]:
df1

   values
0      10
1      20
2      30
3      40
4      50

In [150]:
df1.mean()

values    30.0
dtype: float64

In [151]:
df1.std()

values    15.811388
dtype: float64

In [152]:
df1.median()

values    30.0
dtype: float64

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [153]:
def moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [161]:


df5 = pd.DataFrame({
    'Date': pd.date_range(start='2023-01-01', end='2023-01-31'),
    'Sales': [10,25, 20, 15, 30, 25, 40, 35, 50, 45, 60, 55, 70, 65, 80, 75, 90, 85, 100, 95, 110, 105, 120, 115, 130, 125, 140, 135, 150, 145, 160]
})
print(df)

         Date  Sales
0  2023-01-01     10
1  2023-01-02     25
2  2023-01-03     20
3  2023-01-04     15
4  2023-01-05     30
5  2023-01-06     25
6  2023-01-07     40
7  2023-01-08     35
8  2023-01-09     50
9  2023-01-10     45
10 2023-01-11     60
11 2023-01-12     55
12 2023-01-13     70
13 2023-01-14     65
14 2023-01-15     80
15 2023-01-16     75
16 2023-01-17     90
17 2023-01-18     85
18 2023-01-19    100
19 2023-01-20     95
20 2023-01-21    110
21 2023-01-22    105
22 2023-01-23    120
23 2023-01-24    115
24 2023-01-25    130
25 2023-01-26    125
26 2023-01-27    140
27 2023-01-28    135
28 2023-01-29    150
29 2023-01-30    145
30 2023-01-31    160

In [162]:
df5 = moving_average(df)
print(df5)

         Date  Sales  MovingAverage
0  2023-01-01     10      10.000000
1  2023-01-02     25      17.500000
2  2023-01-03     20      18.333333
3  2023-01-04     15      17.500000
4  2023-01-05     30      20.000000
5  2023-01-06     25      20.833333
6  2023-01-07     40      23.571429
7  2023-01-08     35      27.142857
8  2023-01-09     50      30.714286
9  2023-01-10     45      34.285714
10 2023-01-11     60      40.714286
11 2023-01-12     55      44.285714
12 2023-01-13     70      50.714286
13 2023-01-14     65      54.285714
14 2023-01-15     80      60.714286
15 2023-01-16     75      64.285714
16 2023-01-17     90      70.714286
17 2023-01-18     85      74.285714
18 2023-01-19    100      80.714286
19 2023-01-20     95      84.285714
20 2023-01-21    110      90.714286
21 2023-01-22    105      94.285714
22 2023-01-23    120     100.714286
23 2023-01-24    115     104.285714
24 2023-01-25    130     110.714286
25 2023-01-26    125     114.285714
26 2023-01-27    140     120.714286
27 2023-01-28    135     124.285714
28 2023-01-29    150     130.714286
29 2023-01-30    145     134.285714
30 2023-01-31    160     140.714286

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [163]:
def add_weekday_column(df):
    df['Weekday'] = pd.to_datetime(df['Date']).dt.day_name()

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

add_weekday_column(df)

print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [164]:
def select_january_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    january_dates = df.loc[mask]
    return january_dates

In [165]:
january_dates = select_january_dates(df)

In [166]:
january_dates

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
import pandas